[{"author": "358 comentários", "date": "Ordenar por", "text": "Adicione um comentário…", "likes": "Fixado por City Beautiful"}, {"author": "CityBeautiful", "date": "há 2 semanas", "text": "For those who made it to the end, oops, somehow the audio for the Nebula promo didn't export and I neglected to check it! If you'd like to support the channel, visit https://go.nebula.tv/citybeautiful and sign up to get $20 off. The next video on Beverly Hills is already live there!", "likes": "111"}, {"author": "NothingXemnas", "date": "há 2 semanas", "text": "The moment you started demolishing houses to get a road through, it got realistic! SUCH TRAGEDY!", "likes": "738"}, {"author": "martinbruhn5274", "date": "há 2 semanas", "text": "Don't feel too bad about failed US city planning, many european cities are also working hard at undoing some of the failures of car friendly city planning of the past.", "likes": "353"}, {"author": "dustinthompson8600", "date": "há 2 semanas", "text": "I would love to see a video starting with the final state of this map and then trying to undo the damage that was done by suburbanization!", "likes": "310"}, {"author": "unclvinny", "date": "há 2 semanas", "text": "I'm so glad to see Townscaper getting some attention, it's such a beautiful little thing to play with.", "likes": "172"}, {"author": "DharmaVibes", "date": "há 2 semanas (editado)", "text": "As an american who has lived near freeways his entite life, my ears are ringing just looking at this road you built. I hate the noise the most", "likes": "128"}, {"author": "the.abhiram.r", "date": "há 2 semanas", "text": "the funny thing about \"towers in the park\" developments are that the developments that actually have green space between these towers in nyc are now being sold as high end luxury housing", "likes": "56"}, {"author": "Alex-cw3rz", "date": "há 2 semanas (editado)", "text": "The original town reminded me a lot of an expanded Portmerion a village in Wales made by Clough Williams-Ellis he has one of my most favourite architecture / Urban Design quotes which is : Cherish the past, adorn the present, construct the future.", "likes": "137"}, {"author": "liamalancheril6743", "date": "há 2 semanas (editado)", "text": "Genius way to show and not tell the history. Thanks for your work!", "likes": "103"}, {"author": "tonysebo9010", "date": "há 2 semanas", "text": "In cites that are not absolutely booming and attracting huge populations, most of the suburban and edge city lands should be reclaimed for agriculture and wilderness. This would be done over time, so once a house or distract loses its attraction, simple demolition should take place. Instead of putting in more infrastructure and more development (even more intensive) will continue to bleed most proper city/inner core/downtowns of their vitality and potential", "likes": "61"}, {"author": "toby319", "date": "há 2 semanas", "text": "The last parts where you suggest at a few slightly denser neighbourhoods really highlighted the 'plaster on a broken leg' analogy, and it made me sad how accurately this depicts our long, long path to recreating nice places", "likes": "26"}, {"author": "Civil_Maniac", "date": "há 2 semanas", "text": "I would love to see you apply some the principals you talk about and rehabilitate this city", "likes": "41"}, {"author": "Lemmings19", "date": "há 2 semanas", "text": "Townscraper is good fun. If the devs put out an expansion pack of sorts for a couple of bucks, (new features and buildings and stuff!) I would buy it.", "likes": "120"}, {"author": "dwarftoad", "date": "há 2 semanas (editado)", "text": "Don't forget that the warterfront warehouses, railyards, etc, and a lot of the inner city industry (therefore blue collar jobs therefore nearby housing, eventually other jobs as well), would have moved out of the city to be closer to the freeways as freight transportation moved to trucking rather than water (or rail).  So they would start to become unused which makes it even easier to plow a highway down the edge of the waterfront or through low income neighboorhoods.", "likes": "14"}, {"author": "mechastophiles2118", "date": "há 2 semanas", "text": "\"Not best practices\" is a helluva understatement ", "likes": "28"}, {"author": "FullerHob", "date": "há 2 semanas", "text": "I really like this kind of video. It's really easy to watch in the background while doing something else because of how relaxed it is", "likes": "4"}, {"author": "theoptimisticmetalhead7787", "date": "há 2 semanas", "text": "I would love to see you illustrate some of this stuff with Cities:Skylines!", "likes": "31"}, {"author": "SinZilla-Official", "date": "há 2 semanas", "text": "The US used to do well in architecture when it comes to the design process, development, finishing touches, etc. It used to be a work of art. Unfortunately many of the historical buildings, monuments, and what some people call relics were demolished and bulldozed to make parking spots so that cities around the US could be more car centric. I personally hate the idea of urbanism when it comes to car dependency.", "likes": "116"}, {"author": "ncubesays", "date": "há 2 semanas", "text": "You should check out Croydon just south of London. This video epitomises the \"planning\" it had in the 1960s.", "likes": "6"}, {"author": "MrShanester117", "date": "há 2 semanas", "text": "I’ve had townscaper for years and I didn’t know you could create a green space like that!", "likes": "9"}, {"author": "yeyeTF2", "date": "há 2 semanas", "text": "we went from vacation destination to the place I grew up real quick", "likes": "9"}, {"author": "carolinemcgovern4488", "date": "há 12 dias (editado)", "text": "I've only just started watching this and already I am loving the visual element of the growth of the suburbs. This is such a cool way to visualise the topic. Suggestion- use this game to talk about the 15-minute cities while creating them in Townscaper that would be very cool", "likes": "1"}, {"author": "goldnile718", "date": "há 2 semanas", "text": "This was actually such a satisfying watch. Definitely more of these gameplay videos please. Thanks ", "likes": "3"}, {"author": "jacktattersall9457", "date": "há 2 semanas", "text": "The elevated 'freeway' with windows in it almost looks like some prison. Maybe the City Beautiful Townscaper Police Service partnered with the City Beautiful Townscaper Transportation and Roads Department to build elevated freeways with prisons built into the road deck ", "likes": "17"}, {"author": "kingkal81", "date": "há 2 semanas", "text": "I love it. It reminds me of the British, Irish & European countryside.", "likes": "3"}, {"author": "TripleOmega", "date": "há 2 semanas", "text": "You said soul crushing hotels and then showed a true concrete wasteland. I think you were being too kind.", "likes": "8"}, {"author": "SyntekkTeam", "date": "há 2 semanas", "text": "Loved this exercise! It would be great to see this in a summarized version so more people can see this full transition", "likes": "1"}, {"author": "bearcb", "date": "há 2 semanas (editado)", "text": "The high freeway at the San Francisco embarcadero was a shock to me first, but then I remembered the Perimetral bridge in downtown Rio, a very similar absurdity. It was demolished recently, with the same effect as in S.F.: a much improved cityscape.", "likes": "Now São Paulo has to do the same with its version, the elevado Costa e Silva, popularly known as Minhocão (the big worm)."}, {"author": "allocater2", "date": "há 2 semanas", "text": "Your central city needed more parking lots.", "likes": "10"}, {"author": "kennethwehrs8924", "date": "há 2 semanas", "text": "I think you answered your own question. The reason people are okay with living \"30 miles from the grocery store\" is because dealing with American big city traffic is a real deterrent to living there. I live in a town of 1000 people over 200 miles from any city with a population of over 100,000. And many of the people here refuse to live and drive in the \"big city\" of Lincoln, Nebraska.", "likes": "1"}, {"author": "odo324", "date": "há 2 semanas", "text": "I really like the over-head view while you explain these concepts! Thanks for the video!", "likes": "2"}, {"author": "seanwhite3498", "date": "há 2 semanas (editado)", "text": "Hey another cool game to play would be Kingdoms and castles! Its recently had a update and theres a mod that adds extra housing types if the base 3 are not to your liking, New houses is the mod. I also suggest Flippy as a mod as it is just a little quality of life mod that flips buildings.", "likes": "2"}, {"author": "wellwell7950", "date": "há 2 semanas", "text": "I wish Suburbs were as pretty as this", "likes": "22"}, {"author": "Snakke40", "date": "há 2 semanas", "text": "The Nebula clips at the end being silent and suddenly being interrupted again by a voice is funny", "likes": "7"}, {"author": "joostvankerckhoven9789", "date": "há 4 dias", "text": "Nice and fun idea (love this game! wasted so many hours of my life on it already lol). But you could REALLY do this in a realistic way with Cities: Skylines! Cities: Skylines 2 is coming out later this year and I am beyond excited about it because it's starting to look amazing from all the previews!!!", "likes": "1"}, {"author": "sams3015", "date": "há 2 semanas", "text": "Great video, it was so enjoyable. I was playing Simcity 4 today, purposely trying to make a terribly 20th century city then make my self fix it later", "likes": "6"}, {"author": "suekuarell4685", "date": "há 2 semanas", "text": "As an e-learning developer and a town scraper enthuiast myself, this vas very inspiring", "likes": "Responder"}, {"author": "msCytrynka", "date": "há 2 semanas", "text": "Thank you for making this video for us ️", "likes": "1"}, {"author": "michellechang827", "date": "há 2 semanas", "text": "I really loved this video! An entertaining way to demonstrate how cities changed over time in NA. Also some funny moments. \"oh yeah, look at this, it's looking real good now. this is about as ugly as you can make townscaper\" hahaha", "likes": "2"}, {"author": "Hopperton", "date": "há 3 dias", "text": "Never heard more truth come out of this man's mouth when he started building the highway and said \"Im gonna keep the church unlike other city planners who would just tear it down especially if it was minority or poor serving.\" Lmao", "likes": "1"}, {"author": "noemichillt", "date": "há 12 dias", "text": "I get the idea behind suburbs. Even the pretty „Altstadt“ in various European cities is stained grey from emissions. I moved to the countryside 9 years ago after living in cities most of my life. I needed greenery and more space for my mental health. But why would you build houses after houses without providing the facilities for your everyday needs within 10 minutes walking distance? Schools, grocery stores, GP, hair dresser, etc. This alone would help a lot to make one’s life easier and a lot less car dependent. Allow small businesses in residential areas, ban traffic in city centers and build a reliable public transportation system. That would be a good start.", "likes": "Ler mais"}, {"author": "stanyu2029", "date": "há 2 semanas", "text": "Your tour of US city planning/design history tells me that everything we hate about American cities began with one key assumption: that while Americans would still want to be about 10-20 minutes away from wherever they work or play, that travel time should be spent driving a personal motor vehicle rather than walking or riding a bicycle or streetcar.  Thus city planning scaled up to accommodate parking and driving.", "likes": "2"}, {"author": "ericwright8592", "date": "há 2 semanas", "text": "15:25 I'm looking at you i-95 through most of the north east. New Haven comes to mind as pretty egregious separation of a city from it's waterfront. I-91 also did a good job of wrecking the area.", "likes": "1"}, {"author": "nighthawk8412", "date": "há 2 semanas", "text": "I love this. I loved learning about Jane Jacobs. She seems like a true rebel.", "likes": "Responder"}, {"author": "lociobello", "date": "há 2 semanas", "text": "You should make a cities skyline/simcity one! I would love your commentary on that kind of more complex city buiding games", "likes": "1"}, {"author": "girldaddividendinvestor", "date": "há 2 semanas", "text": "Just finished reading Power Broker, Moses was a fascinating imperialist.", "likes": "6"}, {"author": "ac1455", "date": "há 2 semanas", "text": "This is the villain arc? Has the spirit of Robert Moses possessed him?", "likes": "15"}, {"author": "keltiboissonneault4263", "date": "há 2 semanas", "text": "Awesome! I would love to see a vid where one deconstructs a modern city to encourage density and nature balance: a hypothesis about what a future city could look like if we committed do de-paving and restoring public space.", "likes": "Responder"}, {"author": "tomslastname5560", "date": "há 2 semanas (editado)", "text": "I absolutely love city building games, and I never even knew about this one until I saw this video! And this video convinced me not to buy this game, lol", "likes": "(just kidding, it actually does look like a charming little game. I'm just more into city-building simulators. Still looks kinda fun though)"}, {"author": "somerandomguy6028", "date": "há 2 dias", "text": "It is sad how this actually happened in many European cities and towns during the 60s and 70s.", "likes": "Responder"}, {"author": "dendroleon", "date": "há 2 semanas", "text": "what a fun use of townscaper!  thanks for this", "likes": "1"}, {"author": "Sagealeena", "date": "há 11 dias", "text": "The US exported a lot of their city planning to Australia. I grew up in the “inner ring” low income housing which has now because popular and very expensive. I now live in one of the three houses you called “the saddest three houses on the map” in the final houses in a neighbourhood which has been torn apart by the huge Citylink elevated freeway next door. There’s literally our three one-story houses, with a coupon small apartment blocks and then the huge poorly-maintained social housing nearby. We have basically no access to the community just on the other side of the freeway", "likes": "Ler mais"}, {"author": "Gryphonisle", "date": "há 2 semanas", "text": "I’m hoping you HAVE to know the suburbs are nearly as old as humanity.  Ancient texts have a quote from someone extolling the virtue of their suburban home; its proximity to the city, yet still removed from the urban grit and noise, and the city in question is ancient Babylon.", "likes": "Ler mais"}, {"author": "64ElMariachi", "date": "há 2 semanas", "text": "wow, BRUTAL.  But perfectly illustrates what it all went wrong.", "likes": "3"}, {"author": "BeepBoop2221", "date": "há 12 dias", "text": "Could you do a video of how this same island could be planned correctly?", "likes": "Responder"}, {"author": "misostreams232", "date": "há 9 dias", "text": "20:23 I felt this so much I was in Central Phoenix on a Saturday afternoon, and there was almost no one around just a few people like myself grabbing lunch", "likes": "Responder"}, {"author": "MyBroSux24", "date": "há 11 dias", "text": "what kinda misses from this in my opinion is the introduction of big outside of town industry plants", "likes": "1"}, {"author": "theoddslovenian", "date": "há 5 dias", "text": "I’m glad townscaper is getting the attention it deserves its a great game, but again it was not designed to be played in this way", "likes": "Responder"}, {"author": "nerdwisdomyo9563", "date": "há 2 semanas (editado)", "text": "49:33 OH MY GOD! Im physically hurting at that image, and at this god awful use of land, just imagine all the trees that got cut down for that crap, i mean, Jesus what a way to ruin nature", "likes": "3"}, {"author": "garryferrington811", "date": "há 2 semanas (editado)", "text": "Townscaper needs freeways in it's program. Gotta get more real. Not to mention box stores, gigantic malls, strip malls, etc.", "likes": "Responder"}, {"author": "erikharaldsson2416", "date": "há 8 dias", "text": "Good video, but I feel like you should have randomly demolished more city center houses to make room for parking there, resulting in some missing buildings in each block.", "likes": "Responder"}, {"author": "PabloBatistaArq", "date": "há 2 dias", "text": "Very creative video, it teaches a lot of stuff!", "likes": "Responder"}, {"author": "idontwanttopickone", "date": "há 2 semanas", "text": "Tip: Turn the grid on, would have helpedyou work out what things look like.", "likes": ""}, {"author": "scifience8297", "date": "há 2 semanas", "text": "Will you ever do a more in-depth video on urban renewal?", "likes": "5"}, {"author": "Korina42", "date": "há 2 semanas", "text": "Dude, you forgot to tear down a neighborhood for a project that never happened so it's just a sad, scary empty area.", "likes": "1"}, {"author": "StephenRichmond89", "date": "há 2 semanas", "text": "Bold choice to not do this in Cities Skylines but I'm assuming it would take a lot longer to build everything there. You would get the parking lots though.", "likes": "Responder"}, {"author": "falafelwaffle2656", "date": "há 1 dia", "text": "I watched this while I ate some canned Mac and cheese (with weird sweet fake cheese sauce) that I attempted to fix with pepper and paprika and it just felt so right for this.", "likes": "Responder"}, {"author": "StephenZhao", "date": "há 2 semanas", "text": "15:47 - wow that is unreal. It looks so out of place in hindsight. I can't believe that was a thing.", "likes": "2"}, {"author": "kaitlynn_L", "date": "há 11 dias", "text": "The part about malls was kind of trippy to listen to, because there's always been (semi)covered markets called malls in the middle of cities accessed on foot. In Europe anyway (eg Covent Garden Market).", "likes": ""}, {"author": "Rockett16", "date": "há 1 hora", "text": "Doing this in Cities Skylines would have been more realistic.", "likes": "1"}, {"author": "carann1115", "date": "há 2 semanas", "text": "it would be amazing for you to try cities skylines!!! the limitations of the actual game mechanics really showcases urban planning and zoning LOL", "likes": "1"}, {"author": "caleb1016", "date": "há 2 semanas", "text": "the only thing this example is missing is large vacant concrete lots in the central city", "likes": "1"}, {"author": "nobuddy8679", "date": "há 11 dias", "text": "You have created something truly atrocious. Well done", "likes": "Responder"}, {"author": "louisthegreat1686", "date": "há 2 semanas", "text": "“Spoiler alert: I did not make this better” ", "likes": ""}, {"author": "Nugcon", "date": "há 4 dias", "text": "Those freeways look so absolutely cursed and ugly, I think it sends the message, well done.", "likes": "1"}, {"author": "zachnora1919", "date": "há 2 semanas", "text": "You should do more of these kinds of vids", "likes": "13"}, {"author": "CitiesByDiana", "date": "há 2 semanas", "text": "now this is the content I crave.", "likes": "Responder"}, {"author": "veitforabetterworld7058", "date": "há 10 dias", "text": "It's very realistic but I think in real life America there would be more parking space.", "likes": "Responder"}, {"author": "maxbooth8611", "date": "há 2 semanas", "text": "Very similar to what happened in the UK!", "likes": "1"}, {"author": "markmuller7962", "date": "há 2 semanas (editado)", "text": "I'm enjoying the video but I know there's a lot of people with little free time or attention span, you may want to make a shorter/edited version of this cute and amazing idea for a wider audience ", "likes": "7"}, {"author": "Kizarat", "date": "há 9 dias", "text": "Imagine if Robert Moses were alive to play City Skylines ", "likes": "1"}, {"author": "jorjicostava2913", "date": "há 8 horas", "text": "playing the game the oposite way it was suposed to is the most american move ever", "likes": "Responder"}, {"author": "Dumr.", "date": "há 3 dias", "text": "The name of the town should be: Prigiški, a town in Europe in Croatia, a charming town. But after Yugoslavia disbanded , The US government took over the town and has decided to make it an “ideal” city in Europe. (Give me suggestions for the city history!)", "likes": "Responder"}, {"author": "ap9970", "date": "há 2 semanas", "text": "Le Corbusiers \"Plan Voisin\" would be interesting to see in Townscaper", "likes": "Responder"}, {"author": "dcseain", "date": "há 2 semanas", "text": "Kentlands, in Gaithersburg, MD, is an example of the modern high-density community, with shopping walkable.", "likes": "Responder"}, {"author": "bobbirdsong6825", "date": "há 2 semanas", "text": "man turns nice island city into california", "likes": "4"}, {"author": "billow1646", "date": "há 2 semanas", "text": "Nebula is great in concept, but damned if I don't wait too long for everything to load and just go back to youtube", "likes": "Responder"}, {"author": "zacharylee33", "date": "há 2 semanas", "text": "Fantastic video! Great idea.", "likes": "Responder"}, {"author": "AndrewMontiveo", "date": "há 2 semanas", "text": "I'm really preferring that spread out development ", "likes": "Responder"}, {"author": "elizabethdavis1696", "date": "há 2 semanas", "text": "Love the video concept any updates on the card game by one of your students that you live streamed once? Please make your livestreams available to watch", "likes": "2"}, {"author": "user-vd7pg3fd4v", "date": "há 2 semanas", "text": "a unique style of video. i enjoyed it.", "likes": "Responder"}, {"author": "jeromepersaud7367", "date": "há 2 semanas", "text": "My guy...I just got to you building the belt line, and I'm like....\"he just made Toronto\". Adding the 401 was the clincher. First it was the DVP. Then the 427. Now the 401. Gahhhhhhhhhhhhh....", "likes": "1"}, {"author": "meilinchan7314", "date": "há 2 semanas", "text": "Most people use war games to demonstrate historical events. This is, I admit, no less interesting.", "likes": "Responder"}, {"author": "jameskesler6477", "date": "há 2 semanas", "text": "Needed to add more skyscrapers in downtown", "likes": "Responder"}, {"author": "iain.sm.c", "date": "há 2 semanas", "text": "Straight Moses posting, love to see it.", "likes": "1"}, {"author": "robertbalazslorincz8218", "date": "há 5 dias", "text": "I think maybe Cities: Skylines or maybe even Transport Fever 2 might be a better tool of explanation?", "likes": "1"}, {"author": "seanmartin3973", "date": "há 13 dias", "text": "Did the 'frontier mindset' of Manifest Destiny have anything to do with Americans' desire to build out rather than up? Or did it purely have to do with the development of the automobile?", "likes": "Responder"}, {"author": "Mrwizard-ck7oe", "date": "há 2 dias", "text": "Ever thought about doing a city skylines letsplay? lol maybe not a bad idea with 2 coming out soon ", "likes": "Responder"}, {"author": "M3G4FR34K", "date": "há 2 semanas", "text": "My body is ready, my heart is not.", "likes": "6"}, {"author": "nyc90", "date": "há 2 semanas", "text": "why wouldn't you use cities skylines to represent this, or at least an app that actually lets you create roads?", "likes": "1"}, {"author": "hooverjam", "date": "há 2 semanas", "text": "Awesome! Do you have the save code to share?", "likes": "Responder"}, {"author": "logwhitley", "date": "há 2 semanas", "text": "Glasgow was absolutely destroyed by this.", "likes": "Responder"}, {"author": "themidweekfixture5059", "date": "há 2 semanas", "text": "I live in the inner ring suburbs of Colorado Springs in a 768sqft house about 2km from downtown, it's not optimal but compared to the modern suburbs being built like 15-20 miles out with 3000sqft houses, I'll gladly take it", "likes": "3"}, {"author": "bugsymelone3", "date": "há 2 semanas", "text": "looks a little like the island of Marken in the Netherlands....so you could name it Marken ", "likes": "Responder"}, {"author": "MrJuppia", "date": "há 2 semanas", "text": "Great concept for a video!", "likes": "Responder"}, {"author": "volentastudios4673", "date": "há 2 semanas", "text": "You should take that and show us how you would fix it", "likes": "1"}, {"author": "djmac171", "date": "há 2 semanas", "text": "You and city planner plays need to do a collab!", "likes": "Responder"}, {"author": "carstarsarstenstesenn", "date": "há 2 semanas", "text": "love this", "likes": "Responder"}, {"author": "MrJuppia", "date": "há 2 semanas", "text": "Maybe it was just me but some of the audio in the Nebula add seemed to be missing. Is it a mistake in editing or is yt censoring built-in adds now?", "likes": "Responder"}, {"author": "youngchu1638", "date": "há 2 semanas", "text": "Many \"white collar\" jobs became remote and reduced much needed traveling/driving that they used to do, why haven't they created more office buildings to their neighborhoods (not just grocery stores and other retail stores)? it is unbelievable that Houston TX is expanding their freeways due to increasing population (and destroying african-american businesses [barber shops, eateries, churches, music shops and studios]) like it happened in Buffalo NY in 1960s , rather than create more public transit (to split people up) and able move people more effectively.", "likes": "Ler mais"}, {"author": "Gayoinion", "date": "há 2 semanas", "text": "There’s a really fun city building app called bit city you should make a video on it", "likes": "2"}, {"author": "Vekka_The_Asura", "date": "há 2 semanas", "text": "the comments in the beginning abut cities being seen as dirty in the 30's there was a good historical reason for that if you go back to the medieval period Cities were looked at as places you went to die and later periods of poor sanitation did not do anything to improve the situation form the plague to the cholera epidemics and even the Spanish flue all spread faster in the cities. and even to this day many people would find living in a unincorporated village more appealing than a loud filthy city or suburb", "likes": "2"}, {"author": "CrazySpruiker2001", "date": "há 2 semanas", "text": "Please do more gaming videos!", "likes": "Responder"}, {"author": "thegamingblob69", "date": "há 2 semanas", "text": "LOL I bought townscaper almost two years ago. Only played it for 5 minutes", "likes": "3"}, {"author": "Thorpen_Alnyr", "date": "há 2 semanas", "text": "Wow, you made the city more efficient. I prefer U.S. Planning.", "likes": "1"}, {"author": "definitelynotacrab7651", "date": "há 8 dias", "text": "Are you sure youre not Robert Moses reincarnated? You seemed to be having a lot of fun tearing down that historic city .", "likes": "Responder"}, {"author": "jonathanstafford3383", "date": "há 2 semanas", "text": "There’s London Paris Munich and Berlin ( a few other German cities) that have great city designs all of which made possible by the destruction of their cities during ww1 and 2 … the rest of Europe is shit to travel unless your on a train", "likes": "Responder"}, {"author": "trueshy", "date": "há 2 semanas", "text": "I admire your time & effort on this but who the F wants barns & silos near any city? Not me. It makes no sense as it's dead space for citizens who don't own the property or for consumers trying to get into the downtown area. The US has become the 20 trillion economy (the greatest in the world) based on US planners not poorer Europeans & their planners. The US is older now then ever (thanks to the post war births rates) coming in at 39 years old. ", "likes": "Ler mais"}, {"author": "nhansemark", "date": "há 2 semanas", "text": "Interesting video transition from watching about military Urban Operations ", "likes": "Responder"}, {"author": "Bram06", "date": "há 2 semanas", "text": "Aren't you worried this video is going to kill your channel? I'm not saying this video is boring, but since it's so long and unedited, it'll have extremely low retention and YouTube will stop recommending more videos to your subscribers", "likes": "Responder"}, {"author": "etbadaboum", "date": "há 1 dia", "text": "Moses was really the anti-Haussmann of the modern time", "likes": "Responder"}, {"author": "overthecounterbeanie", "date": "há 2 semanas", "text": "Still too colourful. Everything should be gray, beige or greige, with black roof tiles.", "likes": "6"}, {"author": "kieranmartin2726", "date": "há 2 semanas", "text": "You should totally revisit Cities Skylines but on Cities Skylines 2.", "likes": "Responder"}, {"author": "j0nm055", "date": "há 2 semanas", "text": "Maybe call it Jacobsville?", "likes": "2"}, {"author": "swunt10", "date": "há 2 semanas", "text": "Not enough car parking in the city. You need to destroy most houses in the city with car parking spaces and highways.", "likes": "4"}, {"author": "patrickkennedy3786", "date": "há 4 dias", "text": "Lol, I think you just made Seattle!", "likes": "Responder"}, {"author": "freemandrew", "date": "há 2 semanas", "text": "My name submission: \"Cinque Terror\". Amusingly, Nebula doesn't have a comments section (AFAIK) to suggest a city name so I came back to Youtube .", "likes": "Responder"}, {"author": "gnortsmralien2322", "date": "há 2 semanas", "text": "Hey, if you can't beat 'em, join 'em! (But try to beat 'em first)", "likes": "Responder"}, {"author": "ungesagt", "date": "há 2 semanas", "text": "Nice video! Doesn´t know that Hinterland is also used in English too.", "likes": "Responder"}, {"author": "thegmanpaints", "date": "há 2 semanas", "text": "put the downtown area facing east and the city looks like saint Louis, Missouri", "likes": "Responder"}, {"author": "femboyshiro", "date": "há 12 dias", "text": "can you do the same thing in Cities Skylines? PLEASE, I'M BEGGING YOU!!", "likes": "Responder"}, {"author": "enchantingdan3449", "date": "há 3 dias", "text": "Hmm, was that highway interchange near Jacksonville?", "likes": "Responder"}, {"author": "lukewiese5189", "date": "há 2 semanas", "text": "Love townscaper", "likes": "1"}, {"author": "johnhoftb", "date": "há 2 semanas (editado)", "text": "The word beltline makes me shutter since I live in the Houston area where they are putting up a third one.", "likes": ""}, {"author": "jackcrowell4484", "date": "há 2 semanas", "text": "Gotta demolish all those row houses for parking lots for maximum realism", "likes": "Responder"}, {"author": "TheMagicofJava", "date": "há 11 dias", "text": "Wonderful a few more malls and you have Jakarta.", "likes": "Responder"}, {"author": "xyabc1463", "date": "há 2 dias", "text": "As i name, i think.. Aipotu would fit very nicely.", "likes": "Responder"}, {"author": "kesters7366", "date": "há 2 semanas", "text": "when city skylines 2 comes out i would love to see you play it", "likes": "Responder"}, {"author": "gorizzahzill7485", "date": "há 2 semanas", "text": "Do it in Cities Skyline next time", "likes": "1"}, {"author": "JacobIsaacs-qm7rz", "date": "há 8 dias", "text": "Can you fixing us city using European planning in townscaper", "likes": "Responder"}, {"author": "livingbeings", "date": "há 2 semanas", "text": "You forgot to drop trailer parks out near exurbia", "likes": "Responder"}, {"author": "misostreams232", "date": "há 9 dias", "text": "You should do this in city skylines", "likes": "Responder"}, {"author": "parstern8674", "date": "há 2 semanas", "text": "\"Belleville\" might work as a name for it. A bit on the nose perhaps, but still.", "likes": "Responder"}, {"author": "woltews", "date": "há 2 semanas", "text": "II think city skylines might have been a better game for this demo", "likes": "1"}, {"author": "EcceQuomodoMoritur00", "date": "há 2 semanas", "text": "Btw, the Nebula ad audio at the end is.... nonexistent. Probably not intentionally :)", "likes": "Responder"}, {"author": "kfen8794", "date": "há 2 semanas", "text": "it looked like your were designing Dallas TX in this video", "likes": "Responder"}, {"author": "tatianaes3354", "date": "há 2 semanas", "text": "THE EARTHQUAKE is the way to go.", "likes": ""}, {"author": "jjjj5452", "date": "há 12 dias", "text": "you just need big parking lots", "likes": "Responder"}, {"author": "Leonid_333", "date": "há 11 dias", "text": "I hope ull see this. I'm waiting for you reaction on Cities Skylines 2 in October", "likes": "2"}, {"author": "nerdwisdomyo9563", "date": "há 2 semanas", "text": "Im enjoying this", "likes": "1"}, {"author": "SuperHackstock", "date": "há 2 semanas", "text": "name suggestion: Altenburg ;D", "likes": "2"}, {"author": "pineapplepizza27", "date": "há 2 semanas", "text": "Great video", "likes": "Responder"}, {"author": "matthewboyd8689", "date": "há 2 semanas", "text": "OOH OOH!", "likes": ""}, {"author": "alfredogarbanzo2276", "date": "há 2 semanas", "text": "RIP TO WHAT ONCE WAS ATINY LIL HAMLET. </3", "likes": "Responder"}, {"author": "just_in_key", "date": "há 2 semanas", "text": "this is so cursed lmao", "likes": "1"}, {"author": "cnl1213", "date": "há 8 dias", "text": "I am getting Bob Ross vibes.", "likes": "Responder"}, {"author": "lachiephilipson", "date": "há 2 semanas", "text": "Basically looks like Auckland", "likes": "Responder"}, {"author": "BradleyFish-ln4vl", "date": "há 7 dias", "text": "cool video", "likes": "1"}, {"author": "whollylostandgone", "date": "há 2 semanas", "text": "Ohhh this has to be good...", "likes": "1"}, {"author": "ahmedminaj2011", "date": "há 5 dias", "text": "Start gaming more!", "likes": "Responder"}, {"author": "nickmonks9563", "date": "há 2 semanas", "text": "The horror...the horror...", "likes": "Responder"}, {"author": "sylviaodhner", "date": "há 2 semanas", "text": "It's missing stroads!", "likes": "2"}, {"author": "etbadaboum", "date": "há 1 dia", "text": "I Am Moses, Destroyer of Charming Towns", "likes": "Responder"}, {"author": "horseplop9", "date": "há 2 semanas", "text": "Fun video", "likes": "Responder"}, {"author": "the.abhiram.r", "date": "há 2 semanas", "text": "do it in cs2 next", "likes": "Responder"}, {"author": "owenblumenfeld3927", "date": "há 2 semanas", "text": "I love this game", "likes": "5"}, {"author": "cb.on.yt22", "date": "há 2 semanas", "text": "now do it in reverse ", "likes": "Responder"}, {"author": "Leonid_333", "date": "há 2 semanas", "text": "Le corbuse: smiling", "likes": "Responder"}, {"author": "Wowls", "date": "há 2 semanas", "text": "great vid", "likes": "Responder"}, {"author": "andreteixeira6978", "date": "há 8 dias", "text": "1 hour of pain", "likes": "Responder"}, {"author": "celestewilliams5681", "date": "há 2 semanas (editado)", "text": "Omg just like Franklin… ", "likes": "Responder"}, {"author": "Distress.", "date": "há 2 semanas", "text": "So when did it get ruined?", "likes": "Responder"}, {"author": "napoleonibonaparte7198", "date": "há 2 semanas", "text": "Call it Mosesburg.", "likes": "Responder"}, {"author": "Lemmings19", "date": "há 2 semanas", "text": "56:58 you left out the audio for your Nebula promo.", "likes": "5"}, {"author": "neves5083", "date": "há 2 semanas", "text": "MOOOOOOREEEEEE PLEASE, CITIES SKYLINES OR SOMETHING  <:D", "likes": "Responder"}, {"author": "lakrids-pibe", "date": "há 2 semanas", "text": "Name sugestion: Borging Borg", "likes": "Responder"}, {"author": "matthewmadeira7892", "date": "há 2 semanas", "text": "Highly recommend Power Broker by Caro, Moses was not a great guy", "likes": "Responder"}, {"author": "hairypotter259", "date": "há 2 semanas", "text": "Some of lil comment boxes were real funny", "likes": "Responder"}, {"author": "ericburgos", "date": "há 2 semanas", "text": "Where are the Subarus with suburban license plates, though?", "likes": "1"}, {"author": "KingArthur13th", "date": "há 2 semanas", "text": "Are you interested in Cities Skylines 2?", "likes": "1"}, {"author": "zenbrane2", "date": "há 2 semanas", "text": "The glee with which you’re doing this is disturbing. lol", "likes": "1"}, {"author": "missouriball1333", "date": "há 2 semanas", "text": "nice", "likes": "1"}, {"author": "michaelacosta9204", "date": "há 2 semanas", "text": "You should try ruining Simcity or Transport Tycoon next.", "likes": "Responder"}, {"author": "W.Gaster", "date": "há 4 dias", "text": "I cannot look at thus video, hurts too much", "likes": "1"}, {"author": "willb3636", "date": "há 2 semanas", "text": "Bikebellia!", "likes": "Responder"}, {"author": "kelly2631", "date": "há 11 dias", "text": "WHERE'S THE PARKINGG??", "likes": "Responder"}, {"author": "constantinexi6489", "date": "há 2 semanas (editado)", "text": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHH NO MORE", "likes": "1"}, {"author": "linusmushroomtips776", "date": "há 5 dias", "text": "Kaliningrad simulator", "likes": "Responder"}, {"author": "heidirabenau511", "date": "há 2 semanas", "text": "You should call it Trashville.", "likes": "Responder"}, {"author": "brad5426", "date": "há 2 semanas (editado)", "text": "3:10 Sorry European, but I am interested in this fact. can someone explain Tammany Hall corruption and if it did, how it impacted Robert Moses?", "likes": "2"}, {"author": "JustinShaw89", "date": "há 2 semanas", "text": "You made Boston lol. Minus the office towers", "likes": "1"}, {"author": "Astromancerguy", "date": "há 2 semanas", "text": "Noooo ", "likes": "Responder"}, {"author": "Cyrus992", "date": "há 2 semanas", "text": "Three things that suck about America: ", "likes": ""}, {"author": "TurkishEmpire2023", "date": "há 7 dias", "text": "good replace walkable areas with mega walmarts and costco, bikes makes me sick", "likes": "2"}, {"author": "kenseitakesi4521", "date": "há 2 semanas", "text": "Town name is Crowania", "likes": "Responder"}, {"author": "AtomicSource11", "date": "há 11 dias", "text": "I was expecting you to knock down every other row house and/or city block during the 60s to meet minimum parking requirements as things get renovated! 🫤", "likes": "1"}]